{
  "anime": {
    "Shonen": {
      "description": "Action-packed anime featuring young male protagonists, battles, and friendship.",
      "titles": {
        "Jujutsu Kaisen": "Yuji Itadori fights curses and seeks to control the King of Curses, Sukuna.",
        "Chainsaw Man": "Denji, a young man, merges with a chainsaw demon to hunt devils.",
        "Demon Slayer": "Tanjiro Kamado hunts demons after his family is slaughtered.",
        "One Piece": "Luffy seeks to become the Pirate King and reach the One Piece treasure.",
        "My Hero Academia": "Izuku Midoriya trains to become the greatest hero.",
        "Attack on Titan": "Eren Yeager leads humanity’s fight against the Titans.",
        "Black Clover": "Asta and Yuno compete to become the Wizard King.",
        "Kaiju No. 8": "Kafka Hibino gains kaiju powers to fight against monsters.",
        "Boruto: Two Blue Vortex": "Boruto protects the Hidden Leaf against new threats.",
        "Sakamoto Days": "A legendary hitman turned family man is dragged back into the underworld."
      }
    },
    "Isekai": {
      "description": "Anime where characters are transported to another world.",
      "titles": {
        "Solo Leveling": "Jin-Woo gains extraordinary powers and becomes the strongest hunter.",
        "Mushoku Tensei": "A reincarnated man in a magical world seeks redemption.",
        "The Rising of the Shield Hero": "Naofumi, betrayed, fights as the Shield Hero.",
        "Eminence in Shadow": "A boy unknowingly creates a real secret organization.",
        "That Time I Got Reincarnated as a Slime": "A man reborn as a slime builds a new world.",
        "Re:Zero": "Subaru can rewind time but faces intense suffering.",
        "Arifureta": "A bullied student becomes overpowered after being abandoned in a dungeon.",
        "No Game No Life": "Gaming prodigies are transported to a world ruled by games.",
        "Tsukimichi: Moonlit Fantasy": "A boy abandoned by a goddess creates his own path.",
        "Jobless Reincarnation": "A reincarnated man strives for a better life."
      }
    },
    "Fantasy": {
      "description": "Magical worlds filled with mystical creatures and heroes.",
      "titles": {
        "Fate/Strange Fake": "A Holy Grail War unfolds in a city full of mages.",
        "The Witch and the Beast": "A dark fantasy with witches and curses.",
        "Hell’s Paradise": "Criminals search for immortality on a deadly island.",
        "Frieren: Beyond Journey’s End": "An elven mage reflects on life after outliving her comrades.",
        "Berserk": "A warrior seeks vengeance and fights his tragic fate.",
        "The Ancient Magus' Bride": "A girl with rare magic is taken in by a sorcerer.",
        "Record of Ragnarok": "The gods battle against humanity’s strongest warriors.",
        "Tower of God": "A boy climbs a mysterious tower full of trials.",
        "Ragna Crimson": "A dragon hunter fights an apocalyptic invasion.",
        "Vinland Saga": "A Viking warrior seeks revenge and redemption."
      }
    },
    "Sci-Fi": {
      "description": "Futuristic settings, advanced technology, and space adventures.",
      "titles": {
        "Steins;Gate": "A scientist accidentally discovers time travel.",
        "Cowboy Bebop": "Bounty hunters travel through space seeking adventure.",
        "Ghost in the Shell": "A cyber-enhanced agent investigates cyber crimes.",
        "Trigun": "A pacifist gunman with a huge bounty is pursued.",
        "Psycho-Pass": "A world where crimes are predicted before they happen."
      }
    },
    "Psychological": {
      "description": "Anime that explores deep and intense psychological themes.",
      "titles": {
        "Death Note": "A student gains a notebook that lets him kill anyone.",
        "Monster": "A doctor hunts a serial killer he once saved.",
        "Paranoia Agent": "A mysterious attacker terrorizes a city.",
        "Psycho-Pass": "A society is ruled by a crime-predicting system.",
        "The Promised Neverland": "Orphans uncover a dark secret about their world.",
        "Serial Experiments Lain": "A girl’s reality blurs with the digital world.",
        "Kaiji": "A gambler fights for survival in deadly games.",
        "Erased": "A man goes back in time to prevent a murder.",
        "Revolutionary Girl Utena": "A girl fights in duels to protect a princess.",
        "Madoka Magica": "A dark twist on the magical girl genre."
      }
    },
    "Romance": {
      "description": "Love stories filled with emotions, drama, and heartfelt moments.",
      "titles": {
        "Your Lie in April": "A pianist rediscovers his love for music through a girl.",
        "Toradora!": "Two students with crushes help each other win love.",
        "Kaguya-sama: Love Is War": "Two geniuses battle in love.",
        "Clannad": "A boy helps a lonely girl rediscover happiness.",
        "Horimiya": "A high school romance between two opposites.",
        "Fruits Basket": "A girl lives with a family cursed to turn into animals.",
        "The Angel Next Door Spoils Me Rotten": "A kind neighbor takes care of a lazy student.",
        "Kimi ni Todoke": "A shy girl finds friendship and love.",
        "Ao Haru Ride": "A girl reconnects with her first love.",
        "My Dress-Up Darling": "A cosplayer and a craftsman grow close."
      }
    },
    "Comedy": {
      "description": "Humorous anime with absurd situations and lighthearted storytelling.",
      "titles": {
        "Spy x Family": "A spy creates a fake family for a mission.",
        "Bocchi the Rock!": "A shy girl finds confidence through music.",
        "Nichijou": "A surreal comedy with bizarre everyday moments.",
        "Grand Blue": "College students engage in wild diving club antics.",
        "Gintama": "A samurai and his friends take odd jobs in a world invaded by aliens.",
        "Yuru Camp": "High school girls enjoy camping trips.",
        "Uzaki-chan Wants to Hang Out!": "A lively girl teases her introverted upperclassman.",
        "The Great Jahy Will Not Be Defeated!": "A demon lord struggles after losing her powers.",
        "Asobi Asobase": "Three eccentric girls create a weird after-school club.",
        "KonoSuba": "A hilarious isekai parody with a dysfunctional party."
      }
    },
    "Sports": {
      "description": "Anime that focuses on competition, teamwork, and the personal growth of athletes in various sports.",
      "titles": {
        "Blue Lock": "Japan’s best soccer prospects compete to become the ultimate striker.",
        "Haikyuu!!": "A determined volleyball player and his team strive to reach the top.",
        "Slam Dunk": "A delinquent joins a high school basketball team to impress a girl."
      }
    },
    "Horror": {
      "description": "Anime that focuses on terrifying situations, psychological horror, and supernatural elements.",
      "titles": {
        "Another": "A cursed classroom leads to mysterious and gruesome deaths.",
        "Higurashi: When They Cry": "A small village harbors dark secrets and recurring tragedies.",
        "Parasyte": "A teenager fights for survival when parasites begin taking over human bodies."
      }
    },
    "Mecha": {
      "description": "Anime that features giant robots piloted by humans in futuristic settings.",
      "titles": {
        "Neon Genesis Evangelion": "Teenagers pilot giant mechs to fight monstrous beings known as Angels.",
        "Gurren Lagann": "A young man joins a rebellion against a tyrannical ruler in a mech-driven world.",
        "Code Geass": "A strategic genius gains the power to command anyone and leads a revolution."
      }
    },
    "Mystery": {
      "description": "Anime revolving around solving crimes, uncovering secrets, and engaging in deep investigations.",
      "titles": {
        "Detective Conan": "A genius detective trapped in a child's body solves crimes.",
        "The Promised Neverland": "Orphans discover a horrifying truth about their existence.",
        "Erased": "A man travels back in time to prevent a series of murders."
      }
    },
    "Slice of Life": {
      "description": "Anime focusing on the everyday lives and personal experiences of characters.",
      "titles": {
        "March Comes in Like a Lion": "A young shogi player navigates personal struggles and relationships.",
        "Barakamon": "A calligrapher moves to a rural village and finds inspiration in its people.",
        "Clannad": "A heartfelt drama about love, loss, and family connections."
      }
    }
  }
}